# PANDAS

# SERIES

In [6]:
import pandas as pd
import numpy as np

In [7]:
s  = pd.Series([1, 3, 5, np.nan, 6, 9])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [8]:
data = np.array(["a", "b", "c", "d"])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [9]:
#How we can retrive data :

In [10]:
s = pd.Series(["a", "b", "c"], index = [1, 2, "favourite"])
s = pd.Series(s)
s

1            a
2            b
favourite    c
dtype: object

In [11]:
s[1]

'a'

In [12]:
s["favourite"]

'c'

In [13]:
s = pd.Series({'Jan':1., 'Feb':2, 'March':25})
s

Jan       1.0
Feb       2.0
March    25.0
dtype: float64

In [14]:
s['Jan']

1.0

# Data Frame

In [15]:
# Creating data frame in python :

In [21]:
import pandas as pd

In [22]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [23]:
lst = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday','Friday', 'Saturday']
df = pd.DataFrame(lst)
df

           0
0     Sunday
1     Monday
2    Tuesday
3  Wednesday
4   Thursday
5     Friday
6   Saturday

In [19]:
data = {'Name':['Swapnil', 'Nikhil', 'Sakshi', 'Neha'], 'Age':[24, 20, 22, 23]}
df = pd.DataFrame(data)
df

      Name  Age
0  Swapnil   24
1   Nikhil   20
2   Sakshi   22
3     Neha   23

In [ ]:
#another way : more simpler and easiler.

In [24]:
df = pd.DataFrame({ 'Names' : ['Swapnil', 'Nikhil', 'Sakshi', 'Neha'],
                  'Age':[24, 20, 22, 23],
                  'Roll No.':[21, 10, 5, 33]})
df

     Names  Age  Roll No.
0  Swapnil   24        21
1   Nikhil   20        10
2   Sakshi   22         5
3     Neha   23        33

In [25]:
data  = ({'a' : 1, 'b' : 2}, {"a":5, "b":10, "c":20})
df = pd.DataFrame(data, index = ['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [26]:
# Creating DataFrame for all operation henceforth :

In [27]:
Cities = pd.DataFrame({'Cites' : ["San Fransico", "Seattle", "Los Angeles", "San Diago"],
                      'Pop' : [10, 15, 20, 24],
                      'Rain' : [2, 10, 1, 3.4]})
Cities

          Cites  Pop  Rain
0  San Fransico   10   2.0
1       Seattle   15  10.0
2   Los Angeles   20   1.0
3     San Diago   24   3.4

In [28]:
Cities.dtypes

Cites     object
Pop        int64
Rain     float64
dtype: object

# Data Frame : Adding a new row and a column

In [29]:
# also known as append

In [31]:
# 1. Add a row in a Data Frame : loc() method

In [17]:
import pandas as pd
import numpy as np

In [18]:
ds = pd.DataFrame({'Name':['Jack', 'Mac', 'Sam', 'Gotya', 'Christian'],
                  'Math' : [87, 91, 97, 95, 66],
                  'Science':[83, 99, 84, 76, 65],})
ds

        Name  Math  Science
0       Jack    87       83
1        Mac    91       99
2        Sam    97       84
3      Gotya    95       76
4  Christian    66       65

In [7]:
ds.loc[len(ds.index)] = ['Ammy', 45, 50]
ds

        Name  Math  Science
0       Jack    87       83
1        Mac    91       99
2        Sam    97       84
3      Gotya    95       76
4  Christian    66       65
5       Ammy    45       50
6       Ammy    45       50

In [50]:
# 2. Add multiple rows in Data Frame : concat() method          pandas.concat

In [28]:
Cities = pd.DataFrame({'Cites' : ["San Fransico", "Seattle", "Los Angeles", "San Diago"],
                      'Pop' : [10, 15, 20, 24],
                      'Rain' : [2, 10, 1, 3.4]})
Cities

          Cites  Pop  Rain
0  San Fransico   10   2.0
1       Seattle   15  10.0
2   Los Angeles   20   1.0
3     San Diago   24   3.4

In [20]:
add = {'Cities' : ['Jeorgo', 'Washington Dc'],
      'Pop': [25, 13],
      'Rain': [2., 6.02]}

add = pd.DataFrame(add)
add

          Cities  Pop  Rain
0         Jeorgo   25  2.00
1  Washington Dc   13  6.02

In [29]:
Cities

          Cites  Pop  Rain
0  San Fransico   10   2.0
1       Seattle   15  10.0
2   Los Angeles   20   1.0
3     San Diago   24   3.4

# Accessing Dataframes

In [5]:
Cities.iloc[:2]

          Cites  Pop  Rain
0  San Fransico   10   2.0
1       Seattle   15  10.0

In [8]:
Cities.iloc[:,0:2]             # ':' means all rows.   0:2 means two columns in total.

          Cites  Pop
0  San Fransico   10
1       Seattle   15
2   Los Angeles   20
3     San Diago   24

In [10]:
Cities.iloc[:,[2]]

   Rain
0   2.0
1  10.0
2   1.0
3   3.4

In [11]:
Cities.iloc[:,[1]]

   Pop
0   10
1   15
2   20
3   24

In [12]:
Cities.iloc[:,[0]]

          Cites
0  San Fransico
1       Seattle
2   Los Angeles
3     San Diago

In [13]:
Cities.iloc[:,2]

0     2.0
1    10.0
2     1.0
3     3.4
Name: Rain, dtype: float64

# Accessing DataFrame by Index

In [16]:
Cities.iloc[[0]]                  # will give us a row

          Cites  Pop  Rain
0  San Fransico   10   2.0